const users = [
  { id: 1, name: "John", age: 25 },
  { id: 2, name: "Alice", age: 30 },
  { id: 3, name: "Bob", age: 20 },
  { id: 4, name: "Sarah", age: 35 },
  { id: 5, name: "Michael", age: 28 },
];

// ------------------------------------------------------------------------------------
//   Найти все имена пользователей в массиве users и сохранить их в новый массив.

// const result = users.map(({ name }) => name);
// console.log(result);

// ------------------------------------------------------------------------------------
//   Проверить, есть ли в массиве users пользователь с возрастом меньше 18 лет. Сформируйте массив из таких пользователей.

// const result = users.filter((user) => user.age < 18);
// console.log(result);

// ------------------------------------------------------------------------------------
//   Найти пользователя с наибольшим возрастом в массиве users.

// users.sort((a, b) => b.age - a.age);
// const result = users[0];
// console.log(result);

// ------------------------------------------------------------------------------------
//   Создать новый массив, содержащий только идентификаторы (свойство id) пользователей из массива users.

// const result = users.map(({ id }) => id);
// console.log(result);

// ------------------------------------------------------------------------------------
//   Посчитать общую сумму возрастов всех пользователей в массиве users.

// const result = users.reduce((acc, { age }) => acc + age, 0);
// console.log(result);

// ------------------------------------------------------------------------------------
//   Изменить возраст пользователя с идентификатором 3 на 22.

// const result = users.map((user) => {
//   if (user.id === 3) {
//     return { ...user, age: 22 };
//   }
//   return user;
// });
// console.log(result);

// ------------------------------------------------------------------------------------
//   Создать новый массив, содержащий имена пользователей, у которых возраст меньше 30.

// const result = users.filter((user) => user.age < 30).map((user) => user.name);
// console.log(result);

// ------------------------------------------------------------------------------------
//   Найти средний возраст пользователей в массиве users.

// const usersAge = users.reduce((acc, { age }) => acc + age, 0);
// const result = usersAge / users.length;
// console.log(result);
